---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceNdfType
source: html/8f9669da-7eef-5148-b233-c2b562ffeb7b.htm
---
# Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceNdfType Property

The property labeled "NDF" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public static string SurfaceNdfType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SurfaceNdfType".